blog/2010/05/28/solar-win-promotion-articles/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>solar-win的推广文章 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>solar-win的推广文章</h1>
  <p>
Solar框架（官方提供的）是基于linux平台的，直接用于windows平台会有很多问题，因为Solar中大量用到了Symlink：
</p>
<ol class="org-ol">
<li>windows在vista(含)后才开始支持symlink。
</li>
<li>windows下的symlink尚不能复制、拷贝。
</li>
</ol>

<p>
这个问题确实比较棘手，我们希望大家能够在win下开发和布署，也希望大家能够在win下开发在linux下布署，所以发布solar for windows是非常有意义的，让一部分不熟悉linux的开发者同样可以自如地使用solar.
</p>

<p>
今天终于能够给大家带来一个好消息了，此版本是solar-win的一个里程卑版本，在本版本中，solar-win的行为已经和linux平台下几乎一 致了。
当然这仍然需要你的windows版本在vista（含）以上，要详细了解，请下载solar-win，并查看其中的README及 script/README。
</p>

<p>
下载地址：<a href="http://solarphp.cn/download/solar-system-1.01-win-latest.rar"><a href="http://solarphp.cn/download/solar-system-1.01-win-0.3.rar">http://solarphp.cn/download/solar-system-1.01-win-0.3.rar</a></a>
当然，你总是可以从这里下载最新的版本：<a href="http://solarphp.cn/download/solar-system-1.01-win-latest.rar"><a href="http://solarphp.cn/download/solar-system-1.01-win-latest.rar">http://solarphp.cn/download/solar-system-1.01-win-latest.rar</a></a>
</p>

<p>
Solar PHP中文官网：<a href="http://solarphp.cn/"><a href="http://solarphp.cn">http://solarphp.cn</a></a> Solar PHP中文论坛：<a href="http://solarphp.org.cn/"><a href="http://solarphp.org.cn">http://solarphp.org.cn</a></a>
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
